In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sb
%matplotlib inline
from pylab import rcParams

<br>

## Operation on Training data

### Train Work data

In [29]:
# Show First 5 records
train_work_data = pd.read_csv('Train Data/train_work.csv')
train_work_data.head(5)

,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent
0,emp-1,184.0,144.0,40.0,144.0,3,77
1,emp-1,176.0,136.0,40.0,136.0,2,98
2,emp-1,200.0,120.0,72.0,120.0,1,14
3,emp-1,160.0,144.0,8.0,144.0,3,147
4,emp-1,171.0,135.0,0.0,135.0,1,42

In [41]:
# Finding the sum of each features for respective Employee ids  
train_work_data = train_work_data.groupby('EmployeeID', as_index=False).agg({
    "TotalWorkingHours": "sum",
    "Billable_Hours": "sum",
    "Hours_off_Duty": "sum",
    "Touring_Hours": "sum",
    "NoOfProjects": "sum",
    "ActualTimeSpent": "sum",
})
train_work_data.head()

,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent
0,emp-1,3424.0,2462.0,408.0,2462.0,42,2849
1,emp-10,2006.0,1274.0,328.0,691.0,13,616
2,emp-100,3607.0,3275.0,224.0,3235.0,23,3388
3,emp-101,4109.5,2759.5,192.0,0.0,18,1953
4,emp-102,3790.0,2720.5,344.0,1861.0,20,2254

In [33]:
train_work_data.shape

(245, 7)

### Train Attrition data

In [42]:
# Show First 5 records
train_attrition_data = pd.read_csv('Train Data/train_attrition.csv')
train_attrition_data.head()

  EmployeeID  Left_Company
0      emp-1           0.0
1     emp-10           1.0
2    emp-100           0.0
3    emp-101           0.0
4    emp-102           0.0

In [58]:
# Dropping EmployeeID
train_attrition_data.drop('EmployeeID',axis=1,inplace=True)

### Combining Train work and Train attrition data

In [59]:
train_data = pd.concat([train_work_data,train_attrition_data],axis=1)

In [61]:
train_data.head()

,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent,Left_Company
0,emp-1,3424.0,2462.0,408.0,2462.0,42,2849,0.0
1,emp-10,2006.0,1274.0,328.0,691.0,13,616,1.0
2,emp-100,3607.0,3275.0,224.0,3235.0,23,3388,0.0
3,emp-101,4109.5,2759.5,192.0,0.0,18,1953,0.0
4,emp-102,3790.0,2720.5,344.0,1861.0,20,2254,0.0

In [62]:
train_data.shape

(245, 8)

<br>

## Operation on Test data

### Test work data

In [34]:
# Show First 5 records
test_work_data = pd.read_csv('Test Data/test_work.csv')
test_work_data.head(5)

,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent
0,emp-2,170.0,124.0,8.0,0.0,4,77
1,emp-2,164.0,114.0,24.0,0.0,4,105
2,emp-2,201.0,139.0,48.0,0.0,4,112
3,emp-2,153.0,114.0,24.0,0.0,2,91
4,emp-2,122.0,106.0,0.0,0.0,2,98

In [35]:
# Finding the sum of each features for respective Employee ids  
test_work_data = test_work_data.groupby('EmployeeID', as_index=False).agg({
    "TotalWorkingHours": "sum",
    "Billable_Hours": "sum",
    "Hours_off_Duty": "sum",
    "Touring_Hours": "sum",
    "NoOfProjects": "sum",
    "ActualTimeSpent": "sum",
})
test_work_data.head()

,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent
0,emp-106,3309.5,2352.0,298.0,2.0,18,1736
1,emp-112,3178.5,2610.0,292.0,325.0,21,1708
2,emp-114,3072.5,1618.7,264.0,1104.0,25,882
3,emp-118,2400.0,2008.0,146.0,728.0,18,1526
4,emp-12,4491.0,2653.0,601.0,799.0,31,1883

In [36]:
test_work_data.shape

(51, 7)

### Test Attrition data

In [63]:
# Show First 5 records
test_attrition_data = pd.read_csv('Test Data/test_attrition.csv')
test_attrition_data.head()

  EmployeeID  Left_Company
0    emp-106           NaN
1    emp-112           NaN
2    emp-114           NaN
3    emp-118           NaN
4     emp-12           NaN

In [64]:
# Dropping EmployeeID
test_attrition_data.drop('EmployeeID',axis=1,inplace=True)

### Combining Test work and Test attrition data

In [65]:
test_data = pd.concat([test_work_data,test_attrition_data],axis=1)

In [66]:
test_data.head()

,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent,Left_Company
0,emp-106,3309.5,2352.0,298.0,2.0,18,1736,NaN
1,emp-112,3178.5,2610.0,292.0,325.0,21,1708,NaN
2,emp-114,3072.5,1618.7,264.0,1104.0,25,882,NaN
3,emp-118,2400.0,2008.0,146.0,728.0,18,1526,NaN
4,emp-12,4491.0,2653.0,601.0,799.0,31,1883,NaN

In [74]:
test_data.shape

(51, 8)

### Create source column for both datasets to identify and seperate train and test data

In [106]:
train_data['source'] = 'train'
test_data['source'] = 'test'
print("Train  :",train_data.shape)
print("Test :",test_data.shape)

Train  : (245, 9)
Test : (51, 9)

<br>

## Train and Test dataset

In [107]:
# append the datasets
Train_Test_data = train_data.append(test_data)
Train_Test_data.head()

,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent,Left_Company,source
0,emp-1,3424.0,2462.0,408.0,2462.0,42,2849,0.0,train
1,emp-10,2006.0,1274.0,328.0,691.0,13,616,1.0,train
2,emp-100,3607.0,3275.0,224.0,3235.0,23,3388,0.0,train
3,emp-101,4109.5,2759.5,192.0,0.0,18,1953,0.0,train
4,emp-102,3790.0,2720.5,344.0,1861.0,20,2254,0.0,train

In [108]:
# Resetting the Index so that the index hows the total rows
Train_Test_data.reset_index(inplace=True)

In [109]:
Train_Test_data.shape

(296, 10)

In [110]:
Train_Test_data.tail()

,index,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent,Left_Company,source
291,46,emp-85,4270.0,3479.5,404.0,16.0,29,2919,NaN,test
292,47,emp-86,4922.5,4285.5,308.0,1905.0,28,1771,NaN,test
293,48,emp-87,4571.5,3595.0,408.0,0.0,27,2639,NaN,test
294,49,emp-91,4465.5,3600.5,343.0,2447.5,24,3850,NaN,test
295,50,emp-95,753.0,418.0,144.0,0.0,4,112,NaN,test

<br>

## Employee Data

In [144]:
# Show First 5 records
Emp_data = pd.read_csv('Employee Data/employee_data.csv')
Emp_data.head()

,EmployeeID,Job_History,Joining_Date,Designation,Sex
0,emp-10,"Worked at Company - 816 , Company - 724 , Comp...",2006_02,VP,0
1,emp-108,"Worked at Company - 205 , Company - 373 , Comp...",2012_01,VP,1
2,emp-115,"Worked at Company - 690 , Company - 280 , Comp...",2012_02,Senior,1
3,emp-121,"Worked at Company - 684 , Company - 159 , Comp...",2012_03,VP,1
4,emp-138,"Worked at Company - 443 , Company - 121 , Comp...",2012_05,Senior,1

In [145]:
Emp_data.shape

(296, 5)

<br>

## Combining Employee and Attribute details

In [146]:
data = pd.merge(Train_Test_data, Emp_data, on='EmployeeID')
data.head(2)

,index,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent,Left_Company,source,Job_History,Joining_Date,Designation,Sex
0,0,emp-1,3424.0,2462.0,408.0,2462.0,42,2849,0.0,train,"Worked at Company - 639 , Company - 212 , Comp...",2011_01,MD,1
1,1,emp-10,2006.0,1274.0,328.0,691.0,13,616,1.0,train,"Worked at Company - 816 , Company - 724 , Comp...",2006_02,VP,0

In [136]:
data.shape

(296, 14)

### Deriving new column for Previous work experience

In [137]:
data['Total_Experience'] = data['Job_History'].str.count('Company')

### Moving the column 'Left_Company' to the end

In [138]:
columns = list(data.columns.values)
columns.pop(columns.index('Left_Company'))
columns.pop(columns.index('source'))
data = data[columns+['Left_Company','source']]
data.head(2)

,index,EmployeeID,TotalWorkingHours,Billable_Hours,Hours_off_Duty,Touring_Hours,NoOfProjects,ActualTimeSpent,Job_History,Joining_Date,Designation,Sex,Total_Experience,Left_Company,source
0,0,emp-1,3424.0,2462.0,408.0,2462.0,42,2849,"Worked at Company - 639 , Company - 212 , Comp...",2011_01,MD,1,3,0.0,train
1,1,emp-10,2006.0,1274.0,328.0,691.0,13,616,"Worked at Company - 816 , Company - 724 , Comp...",2006_02,VP,0,4,1.0,train

In [140]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 296 entries, 0 to 295
Data columns (total 15 columns):
index                296 non-null int64
EmployeeID           296 non-null object
TotalWorkingHours    296 non-null float64
Billable_Hours       296 non-null float64
Hours_off_Duty       296 non-null float64
Touring_Hours        296 non-null float64
NoOfProjects         296 non-null int64
ActualTimeSpent      296 non-null int64
Job_History          296 non-null object
Joining_Date         296 non-null object
Designation          296 non-null object
Sex                  296 non-null int64
Total_Experience     296 non-null int64
Left_Company         245 non-null float64
source               296 non-null object
dtypes: float64(5), int64(5), object(5)
memory usage: 37.0+ KB

### Saving the data for Model building

data.to_csv('Employee_Attrition.csv',index=False)